johnnyclem/neon-link/sdkconfig.defaults
# NEON LINK — pinned build configuration (ESP-IDF v5.3.x, esp32s3)

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Two OTA app slots (see partitions.csv). Rollback arms a new image as
# "pending verify"; web_ui confirms it with esp_ota_mark_app_valid_cancel_
# rollback() once the editor is serving, so an image that cannot get that
# far reverts to the previous slot instead of crash-looping.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 1 ms tick so task-level scheduling stays fine-grained; actual pulse edges
# come from the GPTimer alarm, never from the RTOS tick.
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Ableton Link (milestone 2) requires C++ exceptions.
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# Keep core 1 clear for the pulse engine: pin housekeeping to core 0.
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y

# The pulse ISR re-arms the alarm from IRAM and must survive cache-disabled
# windows (flash writes).
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_ISR_IRAM_SAFE=y

# BLE MIDI on NimBLE, coexisting with WiFi. The runtime kill switch
# (Config.ble_enabled) fully deinitializes the controller.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# W5500 SPI Ethernet (preferred transport when a cable is present).
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# Ableton Link networking: multicast discovery needs SO_REUSE; headroom on
# sockets and default stacks for Link's asio service task.
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
